## Collection of snippets for Pandas

In [2]:
import pandas as pd

### Any `pd.Series` can also be a `pd.DataFrame`

In [3]:
my_list = [1, 2, 3]

In [4]:
index = ["This", "That", "What!"]

In [5]:
pd.DataFrame(my_list, index=index)

       0
This   1
That   2
What!  3

In [6]:
pd.DataFrame(my_list, columns=['a_number'], index=index)

       a_number
This          1
That          2
What!         3

### Creating dataframes using dictionaries

In [202]:
pd.Series({'name': 'Prathamesh', 'age': 28})

name    Prathamesh
age             28
dtype: object

In [206]:
name = ['Jeremy', 'Sebastian', 'Rachel']
age = [45, 29, 40]

In [212]:
pd.DataFrame({'first_name': ['Prathamesh', 'This', 'Vinit'],
              'surname': ["Sarang", "", "Sarang"],
              'age': [28, "", 26]})

#surname

   first_name surname age
0  Prathamesh  Sarang  28
1        This
2       Vinit  Sarang  26

In [224]:
pd.DataFrame([['Prathamesh', 'Vinit'],
             [28, 26], ['Sarang', 'Sarang']]).T

            0   1       2
0  Prathamesh  28  Sarang
1       Vinit  26  Sarang

In [222]:
pd.DataFrame([['Prathamesh', 28, 'Sarang'], 
              ['Vinit', 26, 'Sarang']], 
             columns=['name', 'age', 'surname'])

         name  age surname
0  Prathamesh   28  Sarang
1       Vinit   26  Sarang

### We know that each column is a `pd.Series`

In [231]:
pd.DataFrame([pd.Series(['Prathamesh', 'Vinit']),
pd.Series([28, 29]),
pd.Series(['Sarang', 'Sarang'])]).T

            0   1       2
0  Prathamesh  28  Sarang
1       Vinit  29  Sarang

### We know that each column is a `pd.Series`

In [8]:
pd.Series(my_dict)

this     1
that     2
what!    3
dtype: int64

In [9]:
pd.DataFrame(pd.Series(my_dict))

       0
this   1
that   2
what!  3

## Q: What would be the output of this?

In [10]:
pd.DataFrame([{'a': 1, 'b': 2}, {'b': 3, 'c': 4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

## Before moving on, I also want to talk about numpy vectorization again!

In [56]:
np.array([1, 3, 4, 5, 5])

array([1, 3, 4, 5, 5])

In [57]:
my_arr = np.array([1, 3, 4, 5, 5])

In [58]:
my_arr == 5

array([False, False, False,  True,  True], dtype=bool)

## Want to get the slice using filter

In [59]:
my_arr[my_arr == 5]

array([5, 5])

## You can do it similarly using pandas!

In [60]:
weather_df.head()

,Date/Time,Temp (C),Dew Point Temp (C),Rel Hum (%),Wind Spd (km/h),Visibility (km),Stn Press (kPa),Weather
0,2012-01-01 00:00:00,-1.8,-3.9,86,4,8.0,101.24,Fog
1,2012-01-01 01:00:00,-1.8,-3.7,87,4,8.0,101.24,Fog
2,2012-01-01 02:00:00,-1.8,-3.4,89,7,4.0,101.26,"Freezing Drizzle,Fog"
3,2012-01-01 03:00:00,-1.5,-3.2,88,6,4.0,101.27,"Freezing Drizzle,Fog"
4,2012-01-01 04:00:00,-1.5,-3.3,88,7,4.8,101.23,Fog

### Q: You need to return rows that has 'Weather == Kya Chal raha hai'

### Create a subset where Wind Speed is > 4

In [349]:
weather_df.columns

Index(['Date/Time', 'Temp (C)', 'Dew Point Temp (C)', 'Rel Hum (%)',
       'Wind Spd (km/h)', 'Visibility (km)', 'Stn Press (kPa)', 'Weather'],
      dtype='object')

In [1]:
weather_df[weather_df['Wind Spd (km/h)'] == 4]

### Find all instances when wind speed was above 24 and visibility was 25

In [28]:
df = weather_df2[(weather_df2['Wind Spd (km/h)'] > 24) & (weather_df2['Visibility (km)']== 25)]
df.head()

,Temp (C),Dew Point Temp (C),Rel Hum (%),Wind Spd (km/h),Visibility (km),Stn Press (kPa),Weather
Date/Time,,,,,,,
2012-01-01 23:00:00,5.3,2.0,79,30,25.0,99.31,Cloudy
2012-01-02 00:00:00,5.2,1.5,77,35,25.0,99.26,Rain Showers
2012-01-02 01:00:00,4.6,0.0,72,39,25.0,99.26,Cloudy
2012-01-02 02:00:00,3.9,-0.9,71,32,25.0,99.26,Mostly Cloudy
2012-01-02 03:00:00,3.7,-1.5,69,33,25.0,99.30,Mostly Cloudy

## `df.query`

>DataFrame.query: Query the columns of a frame with a boolean expression.

In [49]:
# Using loc or iloc
# NOTE: slice is `:5:2`, not 6 !
# df.loc[row number/slice, 'Column name/s']

In [55]:
## iloc == numpy slicing! Damn! 
## df.iloc[row number/slice, column number/slice]

## You can do a lot of things with the indices as well: `df.sort_index`

In [37]:
weather_df2.sort_index(ascending=False).head()

,Temp (C),Dew Point Temp (C),Rel Hum (%),Wind Spd (km/h),Visibility (km),Stn Press (kPa),Weather
Date/Time,,,,,,,
2012-12-31 23:00:00,0.0,-2.1,86,30,11.3,99.89,Snow
2012-12-31 22:00:00,-0.2,-1.8,89,28,9.7,99.91,Snow
2012-12-31 21:00:00,-0.5,-1.5,93,28,4.8,99.95,Snow
2012-12-31 20:00:00,0.2,-2.4,83,24,9.7,100.03,Snow
2012-12-31 19:00:00,0.1,-2.7,81,30,9.7,100.13,Snow

## If you have sort values by index, then shouldn't there be sort_by_value?

In [41]:
weather_df2.sort_values(by=['Temp (C)', 'Dew Point Temp (C)'], ascending=False)

,Temp (C),Dew Point Temp (C),Rel Hum (%),Wind Spd (km/h),Visibility (km),Stn Press (kPa),Weather
Date/Time,,,,,,,
2012-06-21 15:00:00,33.0,19.0,44,24,24.1,100.20,Mainly Clear
2012-07-14 15:00:00,33.0,16.8,38,22,48.3,101.31,Mainly Clear
2012-07-14 16:00:00,32.9,15.3,35,24,48.3,101.26,Mainly Clear
2012-08-04 15:00:00,32.8,18.8,44,17,24.1,101.39,Clear
2012-07-14 14:00:00,32.7,15.3,35,28,48.3,101.35,Mainly Clear
2012-06-21 14:00:00,32.6,20.4,49,20,24.1,100.25,Mainly Clear
2012-08-04 17:00:00,32.5,19.8,47,13,24.1,101.32,Clear
2012-08-04 16:00:00,32.5,18.5,44,15,24.1,101.34,Clear
2012-06-21 16:00:00,32.5,17.9,42,24,24.1,100.14,Mainly Clear
2012-07-14 17:00:00,32.5,16.5,38,19,48.3,101.22,Mainly Clear
2012-06-20 18:00:00,32.4,19.9,48,17,24.1,100.61,Mostly Cloudy
2012-06-20 17:00:00,32.3,20.3,49,15,24.1,100.69,Mainly Clear
2012-08-04 18:00:00,32.2,20.1,49,13,24.1,101.29,Mostly Cloudy
2012-06-20 16:00:00,32.2,20.0,49,26,24.1,100.74,Mainly Clear
2012-06-20 15:00:00,32.2,19.6,47,22,24.1,100.75,Mainly Clear
2012-06-21 17:00:00,32.1,17.9,43,30,24.1,100.09,Mainly Clear
2012-07-13 14:00:00,32.1,10.2,26,20,48.3,101.49,Mainly Clear
2012-08-04 14:00:00,32.0,18.3,44,17,24.1,101.48,Clear
2012-07-14 13:00:00,31.9,19.3,47,19,48.3,101.37,Mainly Clear
2012-07-13 15:00:00,31.9,12.3,30,22,48.3,101.46,Clear
2012-06-21 12:00:00,31.8,20.8,52,15,24.1,100.36,Mainly Clear
2012-06-20 14:00:00,31.7,20.4,51,17,24.1,100.83,Clear
2012-07-14 12:00:00,31.7,19.7,49,22,48.3,101.41,Mainly Clear
2012-06-21 13:00:00,31.6,20.6,52,24,24.1,100.32,Mostly Cloudy
2012-07-13 16:00:00,31.6,11.8,30,22,48.3,101.40,Clear
2012-07-14 18:00:00,31.5,18.4,46,15,24.1,101.19,Mainly Clear
2012-07-13 17:00:00,31.4,13.8,34,20,48.3,101.36,Mainly Clear
2012-08-04 13:00:00,31.2,18.1,46,11,24.1,101.56,Clear
2012-07-13 13:00:00,31.2,14.6,37,20,48.3,101.51,Mainly Clear
2012-05-20 16:00:00,31.2,10.7,28,4,48.3,101.61,Mainly Clear
...,...,...,...,...,...,...,...
2012-01-16 02:00:00,-18.5,-23.0,68,6,25.0,103.08,Clear
2012-01-04 06:00:00,-18.5,-24.1,61,11,25.0,101.74,Cloudy
2012-01-21 20:00:00,-18.5,-24.4,60,4,25.0,102.36,Clear
2012-01-04 03:00:00,-18.5,-24.6,59,13,25.0,101.88,Mainly Clear
2012-01-04 04:00:00,-18.5,-24.6,59,13,25.0,101.82,Mainly Clear
2012-01-20 21:00:00,-18.5,-25.6,54,9,25.0,102.37,Mainly Clear
2012-01-22 07:00:00,-18.6,-22.8,69,6,12.9,102.91,Mainly Clear
2012-01-04 05:00:00,-18.6,-24.0,62,9,25.0,101.77,Mainly Clear
2012-01-16 06:00:00,-18.7,-23.2,68,0,25.0,103.01,Clear
2012-01-16 04:00:00,-18.7,-23.5,66,0,25.0,103.05,Clear
2012-01-22 06:00:00,-19.0,-22.9,71,6,0.8,102.85,Freezing Fog
2012-01-16 05:00:00,-19.1,-23.3,69,0,25.0,103.02,Clear
2012-01-16 03:00:00,-19.2,-23.8,67,6,25.0,103.07,Clear
2012-01-15 11:00:00,-19.3,-26.1,55,9,48.3,102.68,Mainly Clear
2012-01-22 05:00:00,-19.5,-23.4,71,6,16.1,102.84,Mainly Clear
2012-01-14 20:00:00,-19.6,-25.8,58,13,25.0,101.62,Mainly Clear
2012-01-14 22:00:00,-19.9,-26.0,58,13,25.0,101.74,Mostly Cloudy
2012-01-14 21:00:00,-20.0,-25.9,59,11,25.0,101.65,Mostly Cloudy
2012-01-14 23:00:00,-20.3,-26.2,59,9,25.0,101.79,Mostly Cloudy
2012-01-15 10:00:00,-20.6,-26.8,58,9,48.3,102.66,Mainly Clear
2012-01-15 03:00:00,-20.7,-26.1,62,4,25.0,102.04,Cloudy
2012-01-15 04:00:00,-21.0,-26.6,61,0,25.0,102.12,Cloudy
2012-01-15 01:00:00,-21.1,-26.6,61,9,25.0,101.86,Cloudy
2012-01-15 00:00:00,-21.2,-26.8,61,11,25.0,101.81,Cloudy
2012-01-15 05:00:00,-21.3,-26.5,63,6,25.0,102.19,Mostly Cloudy
2012-01-15 02:00:00,-21.4,-26.6,63,9,25.0,101.99,Cloudy
2012-01-15 09:00:00,-22.2,-27.8,60,9,48.3,102.57,Mainly Clear
2012-01-15 07:00:00,-22.8,-28.0,62,9,25.0,102.37,Mainly Clear
2012-01-15 06:00:00,-23.2,-28.5,62,7,25.0,102.28,Mostly Cloudy
2012-01-15 08:00:00,-23.3,-28.5,62,7,24.1,102.45,Clear

## `.dt.` or `DateTime` Operator

### What if I don't want datetime values as indices, but I want to get the datetime values as datetime?

In [410]:
weather_df['datetime'] = pd.to_datetime(weather_df['datetime'])

In [418]:
weather_df['month'] = weather_df['datetime'].dt.month
weather_df['day'] = weather_df['datetime'].dt.day
weather_df['quarter'] = weather_df['datetime'].dt.quarter

In [423]:
weather_df['quarter'].value_counts()

4    2208
3    2208
2    2184
1    2184
Name: quarter, dtype: int64

In [422]:
weather_df[weather_df['quarter'] == 2].shape[0]

2184

## `.join()` and `merge()` operations
### The Data

In [486]:
name = ['Magneto', 'Storm', 'Mystique', 
        'Batman', 'Joker', 'Catwoman', 'Hellboy']
alignment = ['bad', 'good', 'bad', 'good', 
             'bad', 'bad', 'good']
gender = ['male', 'female', 'female', 
          'male', 'male', 'female', 'male']
publisher = ['Marvel', 'Marvel', 'Marvel', 
             'DC', 'DC', 'DC', 'Dark Horse Comics']

superheroes1 = pd.DataFrame({'name': name, 
                             'alignment': alignment, 
                             'gender': gender, 
                             'publisher': publisher})

publisher_unique = ['Marvel', 'DC', 'Image']
year_founded = ['1934', '1939', '1992']

publishers = pd.DataFrame({'publisher': publisher_unique, 
                           'year_founded': year_founded})

superheroes2 = pd.DataFrame({'name': ['Black Widow', 'Superman'], 'alignment': ['good', 'good'], 
                             'gender': ['female', 'male'], 'publisher': ['Marvel', 'DC']})

In [487]:
superheroes1

       name alignment  gender          publisher
0   Magneto       bad    male             Marvel
1     Storm      good  female             Marvel
2  Mystique       bad  female             Marvel
3    Batman      good    male                 DC
4     Joker       bad    male                 DC
5  Catwoman       bad  female                 DC
6   Hellboy      good    male  Dark Horse Comics

In [488]:
superheroes2

          name alignment  gender publisher
0  Black Widow      good  female    Marvel
1     Superman      good    male        DC

In [489]:
publishers

  publisher year_founded
0    Marvel         1934
1        DC         1939
2     Image         1992

## Concat

Many a time, we are required to combine different arrays. So, instead of typing each of their elements manually, you can use array concatenation to handle such tasks easily.

In [490]:
pd.concat([superheroes1, superheroes2]).reset_index(drop=True)

          name alignment  gender          publisher
0      Magneto       bad    male             Marvel
1        Storm      good  female             Marvel
2     Mystique       bad  female             Marvel
3       Batman      good    male                 DC
4        Joker       bad    male                 DC
5     Catwoman       bad  female                 DC
6      Hellboy      good    male  Dark Horse Comics
7  Black Widow      good  female             Marvel
8     Superman      good    male                 DC

In [491]:
superheroes = pd.concat([superheroes1, superheroes2], ignore_index=True)

![](https://shanelynnwebsite-mid9n9g1q9y8tt.netdna-ssl.com/wp-content/uploads/2017/03/join-types-merge-names.jpg)

In [492]:
superheroes

          name alignment  gender          publisher
0      Magneto       bad    male             Marvel
1        Storm      good  female             Marvel
2     Mystique       bad  female             Marvel
3       Batman      good    male                 DC
4        Joker       bad    male                 DC
5     Catwoman       bad  female                 DC
6      Hellboy      good    male  Dark Horse Comics
7  Black Widow      good  female             Marvel
8     Superman      good    male                 DC

In [493]:
publishers

  publisher year_founded
0    Marvel         1934
1        DC         1939
2     Image         1992

## Merge

Many a times you will be working with multiple dataframes all at once.

The merge function allows them to be combined into a single data frame

In [494]:
pd.merge(superheroes, 
         publishers, 
         on='publisher', 
         how='left')

          name alignment  gender          publisher year_founded
0      Magneto       bad    male             Marvel         1934
1        Storm      good  female             Marvel         1934
2     Mystique       bad  female             Marvel         1934
3       Batman      good    male                 DC         1939
4        Joker       bad    male                 DC         1939
5     Catwoman       bad  female                 DC         1939
6      Hellboy      good    male  Dark Horse Comics          NaN
7  Black Widow      good  female             Marvel         1934
8     Superman      good    male                 DC         1939

In [495]:
pd.merge(superheroes, 
         publishers, 
         on='publisher', 
         how='inner')

          name alignment  gender publisher year_founded
0      Magneto       bad    male    Marvel         1934
1        Storm      good  female    Marvel         1934
2     Mystique       bad  female    Marvel         1934
3  Black Widow      good  female    Marvel         1934
4       Batman      good    male        DC         1939
5        Joker       bad    male        DC         1939
6     Catwoman       bad  female        DC         1939
7     Superman      good    male        DC         1939

In [496]:
pd.merge(superheroes, 
         publishers, 
         on='publisher', 
         how='right')

          name alignment  gender publisher year_founded
0      Magneto       bad    male    Marvel         1934
1        Storm      good  female    Marvel         1934
2     Mystique       bad  female    Marvel         1934
3  Black Widow      good  female    Marvel         1934
4       Batman      good    male        DC         1939
5        Joker       bad    male        DC         1939
6     Catwoman       bad  female        DC         1939
7     Superman      good    male        DC         1939
8          NaN       NaN     NaN     Image         1992

In [497]:
pd.merge(superheroes1, 
         publishers, 
         on='publisher', 
         how='outer')

       name alignment  gender          publisher year_founded
0   Magneto       bad    male             Marvel         1934
1     Storm      good  female             Marvel         1934
2  Mystique       bad  female             Marvel         1934
3    Batman      good    male                 DC         1939
4     Joker       bad    male                 DC         1939
5  Catwoman       bad  female                 DC         1939
6   Hellboy      good    male  Dark Horse Comics          NaN
7       NaN       NaN     NaN              Image         1992

## Join
***
Simply join two DFs having potentially different row indices

You can do both inner as well as outer joins using the join function in pandas
- Parameters {‘inner’, ‘outer’}, default ‘outer’. Outer for union and inner for intersection.

### `left` join

In [47]:
superheroes1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
name         7 non-null object
alignment    7 non-null object
gender       7 non-null object
publisher    7 non-null object
dtypes: object(4)
memory usage: 304.0+ bytes

In [48]:
publishers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
publisher       3 non-null object
year_founded    3 non-null object
dtypes: object(2)
memory usage: 128.0+ bytes

In [70]:
publishers

  publisher year_founded
0    Marvel         1934
1        DC         1939
2     Image         1992

In [73]:
superheroes1.set_index('publisher')

                       name alignment  gender
publisher
Marvel              Magneto       bad    male
Marvel                Storm      good  female
Marvel             Mystique       bad  female
DC                   Batman      good    male
DC                    Joker       bad    male
DC                 Catwoman       bad  female
Dark Horse Comics   Hellboy      good    male

In [498]:
superheroes1.set_index('publisher').join(publishers.set_index('publisher'), how='left', rsuffix='_publisher')

                       name alignment  gender year_founded
publisher
DC                   Batman      good    male         1939
DC                    Joker       bad    male         1939
DC                 Catwoman       bad  female         1939
Dark Horse Comics   Hellboy      good    male          NaN
Marvel              Magneto       bad    male         1934
Marvel                Storm      good  female         1934
Marvel             Mystique       bad  female         1934

In [499]:
superheroes1.set_index('publisher').join(publishers.set_index('publisher'), how='left', rsuffix='_publisher').reset_index()

           publisher      name alignment  gender year_founded
0                 DC    Batman      good    male         1939
1                 DC     Joker       bad    male         1939
2                 DC  Catwoman       bad  female         1939
3  Dark Horse Comics   Hellboy      good    male          NaN
4             Marvel   Magneto       bad    male         1934
5             Marvel     Storm      good  female         1934
6             Marvel  Mystique       bad  female         1934

### `outer` join

### `inner` join

### `right` join

## Add a few rows as lists

In [97]:
date_time = ['2012-13-01', '2013-01-01', '2013-01-02', '2012-01-02']

## Letting few of them to be NaNs

In [88]:
temp = [np.nan, np.nan, 30, 12]

In [89]:
dew_pt_temp = [-2, np.nan, np.nan, -1]

In [90]:
relative_humidity = [np.nan, np.nan, np.nan, np.nan]

In [91]:
wind_speed = [np.nan, np.nan, np.nan, 50]

In [92]:
visibility = [np.nan, 10.0, np.nan, 12.1]

In [93]:
stn_pressure = [104.1, np.nan, 101.2, 101.24]

In [94]:
weather = ['Snow', None, None, 'Fog']

## Create a new dataframe

In [102]:
pd.DataFrame([date_time, temp, dew_pt_temp, relative_humidity, wind_speed, visibility, stn_pressure, weather])

            0           1           2           3
0  2012-13-01  2013-01-01  2013-01-02  2012-01-02
1         NaN         NaN          30          12
2          -2         NaN         NaN          -1
3         NaN         NaN         NaN         NaN
4         NaN         NaN         NaN          50
5         NaN          10         NaN        12.1
6       104.1         NaN       101.2      101.24
7        Snow        None        None         Fog

In [103]:
weather_df3 = pd.DataFrame([date_time, temp, dew_pt_temp, relative_humidity, wind_speed, visibility, stn_pressure, weather]).T

In [105]:
weather_df3.columns.tolist()

[0, 1, 2, 3, 4, 5, 6, 7]

In [106]:
weather_df3.columns = ['Date/Time', 'Temp (C)', 'Dew Point Temp (C)', 'Rel Hum (%)', 'Wind Spd (km/h)', 'Visibility (km)', 'Stn Press (kPa)', 'Weather']

In [108]:
weather_df3.columns.tolist()

['Date/Time',
 'Temp (C)',
 'Dew Point Temp (C)',
 'Rel Hum (%)',
 'Wind Spd (km/h)',
 'Visibility (km)',
 'Stn Press (kPa)',
 'Weather']

### Display the dataframe

In [109]:
weather_df3.head()

,Date/Time,Temp (C),Dew Point Temp (C),Rel Hum (%),Wind Spd (km/h),Visibility (km),Stn Press (kPa),Weather
0,2012-13-01,NaN,-2,NaN,NaN,NaN,104.1,Snow
1,2013-01-01,NaN,NaN,NaN,NaN,10,NaN,None
2,2013-01-02,30,NaN,NaN,NaN,NaN,101.2,None
3,2012-01-02,12,-1,NaN,50,12.1,101.24,Fog

### Append the `weather_df2` and `weather_df3` by rows

In [114]:
weather_df_appended_1 = weather_df.append(weather_df3)

In [115]:
weather_df_appended_1.reset_index(drop=True, inplace=True)

In [117]:
weather_df_appended_1.tail(10)

,Date/Time,Temp (C),Dew Point Temp (C),Rel Hum (%),Wind Spd (km/h),Visibility (km),Stn Press (kPa),Weather
8778,2012-12-31 18:00:00,-1.3,-3.1,88,17,9.7,100.19,Snow
8779,2012-12-31 19:00:00,0.1,-2.7,81,30,9.7,100.13,Snow
8780,2012-12-31 20:00:00,0.2,-2.4,83,24,9.7,100.03,Snow
8781,2012-12-31 21:00:00,-0.5,-1.5,93,28,4.8,99.95,Snow
8782,2012-12-31 22:00:00,-0.2,-1.8,89,28,9.7,99.91,Snow
8783,2012-12-31 23:00:00,0,-2.1,86,30,11.3,99.89,Snow
8784,2012-13-01,NaN,-2,NaN,NaN,NaN,104.1,Snow
8785,2013-01-01,NaN,NaN,NaN,NaN,10,NaN,None
8786,2013-01-02,30,NaN,NaN,NaN,NaN,101.2,None
8787,2012-01-02,12,-1,NaN,50,12.1,101.24,Fog

In [113]:
weather_df_appended2 = weather_df.append(weather_df3, ignore_index=True)

## Dealing with missing values

In [112]:
weather_df.tail()

,Date/Time,Temp (C),Dew Point Temp (C),Rel Hum (%),Wind Spd (km/h),Visibility (km),Stn Press (kPa),Weather
8779,2012-12-31 19:00:00,0.1,-2.7,81,30,9.7,100.13,Snow
8780,2012-12-31 20:00:00,0.2,-2.4,83,24,9.7,100.03,Snow
8781,2012-12-31 21:00:00,-0.5,-1.5,93,28,4.8,99.95,Snow
8782,2012-12-31 22:00:00,-0.2,-1.8,89,28,9.7,99.91,Snow
8783,2012-12-31 23:00:00,0.0,-2.1,86,30,11.3,99.89,Snow

## How do you filter out the NaNs

* Check the NaNs: `df.isna()`
* Check the Null values: `df.isnull()`

## How do you treat those nulls or NaNs:

* Drop the rows entirely!: `df.dropna()`
* Fill the values with something: `df.fillna()`

## We want count of the values: `.sum()`

In [125]:
weather_df_appended2.isnull().sum()

Date/Time             0
Temp (C)              2
Dew Point Temp (C)    2
Rel Hum (%)           4
Wind Spd (km/h)       3
Visibility (km)       2
Stn Press (kPa)       1
Weather               2
dtype: int64

## What if we just want to check if there's null data or not?: `.any()`

In [135]:
weather_df_appended2.isnull().any()

Date/Time             False
Temp (C)               True
Dew Point Temp (C)     True
Rel Hum (%)            True
Wind Spd (km/h)        True
Visibility (km)        True
Stn Press (kPa)        True
Weather                True
dtype: bool

### Finding the count of nan and empty strings (yes, empty string "" or " " is not handled separately, occurs mostly in character and categorical variable list)

## Remember the numpy aggregate operations?

## using df.mean to do fill operations

In [133]:
weather_df_appended2['Temp (C)'].mean()

8.8009219212383805

In [134]:
weather_df_appended2['Temp (C)'].fillna(value=weather_df_appended2['Temp (C)'].mean()).tail()

8783     0.000000
8784     8.800922
8785     8.800922
8786    30.000000
8787    12.000000
Name: Temp (C), dtype: float64

## Working with string, more examples!

In [136]:
monte = pd.Series(['Graham Chapman', 'John Cleese', 'Terry Gilliam',
                   'Eric Idle', 'Terry Jones', 'Michael Palin'])

### There are generic methods: `.str.`

### But there's one essential thing: using regexes

```bash

Method	    Description
match()	    Call re.match() on each element, returning a boolean.
extract()	Call re.match() on each element, returning matched groups as strings.
findall()	Call re.findall() on each element
replace()	Replace occurrences of pattern with some other string
contains()	Call re.search() on each element, returning a boolean
count()	    Count occurrences of pattern
split()	    Equivalent to str.split(), but accepts regexps
rsplit()	Equivalent to str.rsplit(), but accepts regexps
```

## Using DateTime

In [139]:
from datetime import datetime

In [140]:
datetime.now()

datetime.datetime(2018, 11, 3, 19, 47, 42, 178108)

### `strftime` formatting in python

### [One stop source](http://strftime.org/)

In [141]:
from dateutil import parser
date = parser.parse("4th of July, 2015")
date

datetime.datetime(2015, 7, 4, 0, 0)

In [144]:
date.strftime("%d")

'04'

In [149]:
dates = pd.to_datetime([datetime(2015, 7, 3), '4th of July, 2015',
                       '2015-Jul-6', '07-07-2015', '20150708', '2010/11/12', '2010.11.12'])
dates

DatetimeIndex(['2015-07-03', '2015-07-04', '2015-07-06', '2015-07-07',
               '2015-07-08', '2010-11-12', '2010-11-12'],
              dtype='datetime64[ns]', freq=None)

## Formatting is baked in `pd.to_datetime`

In [150]:
pd.to_datetime('2010/11/12', format='%Y/%m/%d')

Timestamp('2010-11-12 00:00:00')

## We talking about this yesterday!

In [ ]:
pd.date_range(start, periods=1000, freq='M')

## Requested snippet:

### What if there's a date: '13-13-2018'

In [148]:
dates = pd.to_datetime([datetime(2015, 7, 3), '4th of July, 2015',
                       '2015-Jul-6', '07-07-2015', '20150708'])
dates

DatetimeIndex(['2015-07-03', '2015-07-04', '2015-07-06', '2015-07-07',
               '2015-07-08'],
              dtype='datetime64[ns]', freq=None)

## Working with Categorical Variables

In [152]:
weather_df_appended2['Weather'].head()

0                     Fog
1                     Fog
2    Freezing Drizzle,Fog
3    Freezing Drizzle,Fog
4                     Fog
Name: Weather, dtype: object

In [154]:
#pd.get_dummies(weather_df, columns=['Weather'])

## Few other tricks:

### * Reading directly from a simple html webpage

In [126]:
tables = pd.read_html("http://www.basketball-reference.com/leagues/NBA_2016_games.html")